<?php

if (!defined('BASEPATH'))
    exit('No direct script access allowed');

//业务领域
$config['msg'] = [
    10000 => '修改成功!',
    10001 => '修改失败!',
    10002 => '非法操作！',
    10003 => '添加成功！',
    10004 => '添加失败！',
    10005 => '删除成功！',
    10006 => '删除失败！',
    10007 => '您访问的页面不存在！',
    10008 => '您没权限修改这用户的信息！',
    10009 => '您没有权限操作此功能！',
    10010 => '用户名已存在！',
    10011 => '操作成功！',
    10012 => '操作失败！',
    10013 => '导出失败，请联系管理员处理！',
    10014 => '该菜单存在子菜单，不允许删除！',
    10015 => '菜单名称已存在，请重新输入！',
    10016 => '上级菜单选择错误，请重新选择！',
    10017 => '角色名称或者角色CODE已存在，请重新输入！',
    10018 => '该角色正在被使用，不允许删除！',
];